Wikitutorials/tutorials/multiphase/driftFluxFoam/RAS/tank3D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    SYMP3
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    INLE1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    OUTL9
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    OUTL10
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    OUTL11
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    OUTL12
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL6
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL8
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL61
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL62
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL63
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL64
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL65
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL66
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL67
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL68
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL69
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL7
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    WALL70
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    OUTL15
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
